wiki/2016-08-14-CIDR_Notation.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>CIDR</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">CIDR</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#reprint"><div class="category">reprint</div></a> </div>
<div class="char-counter">2016-08-14</div>
        <div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1b2d6c9">前言</a></li>
<li><a href="#org3b1b2c0">What is CIDR Notation</a></li>
<li><a href="#org8181663">IP 编址问题的演进</a>
<ul>
<li><a href="#org3bb2bf7">CIDR 最主要的特点</a></li>
<li><a href="#org869c549">无分类的两级编址</a>
<ul>
<li><a href="#orgdc5698f">无分类的两级编址的记法是：</a></li>
<li><a href="#orgd94a636">CIDR 将网络前缀都相同的连续的 IP 地址组成“CIDR 地址块”。</a></li>
<li><a href="#orge8a690b">CIDR 地址块</a></li>
<li><a href="#org61a5980">路由聚合(route aggregation)</a></li>
<li><a href="#org1073bf9">构成超网</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>


<div id="outline-container-org1b2d6c9" class="outline-2">
<h2 id="org1b2d6c9">前言</h2>
<div class="outline-text-2" id="text-org1b2d6c9">
<p>
<a href="http://blog.sina.com.cn/s/blog_5d76edd80101e48f.html">http://blog.sina.com.cn/s/blog_5d76edd80101e48f.html</a>
</p>
</div>
</div>

<div id="outline-container-org3b1b2c0" class="outline-2">
<h2 id="org3b1b2c0">What is CIDR Notation</h2>
<div class="outline-text-2" id="text-org3b1b2c0">
<p>
Classless Inter Domain Routing (CIDR) is a method for assigning IP
addresses without using the standard IP address classes like Class A,
Class B or Class C. In CIDR notation, an IP address is represented as
A.B.C.D /n, where "/n" is called the IP prefix or network prefix. The
IP prefix identifies the number of significant bits used to identify a
network. For example, 192.9.205.22 /18 means, the first 18 bits are
used to represent the network and the remaining 14 bits are used to
identify hosts. Common prefixes are 8, 16, 24, and 32. Refer to the
following page for the CIDR to Netmask Translation Table.
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">CIDR</th>
<th scope="col" class="org-right">Netmask (Dot Notation)</th>
<th scope="col" class="org-left">Number of Hosts</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">/1</td>
<td class="org-right">128.0.0.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/2</td>
<td class="org-right">192.0.0.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/3</td>
<td class="org-right">224.0.0.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/4</td>
<td class="org-right">240.0.0.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/5</td>
<td class="org-right">248.0.0.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/6</td>
<td class="org-right">252.0.0.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/7</td>
<td class="org-right">254.0.0.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/8</td>
<td class="org-right">255.0.0.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/9</td>
<td class="org-right">255.128.0.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/10</td>
<td class="org-right">255.192.0.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/11</td>
<td class="org-right">255.224.0.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/12</td>
<td class="org-right">255.240.0.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/13</td>
<td class="org-right">255.248.0.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/14</td>
<td class="org-right">255.252.0.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/15</td>
<td class="org-right">255.254.0.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/16</td>
<td class="org-right">255.255.0.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/17</td>
<td class="org-right">255.255.128</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/18</td>
<td class="org-right">255.255.192.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/19</td>
<td class="org-right">255.255.224.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/20</td>
<td class="org-right">255.255.240.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/21</td>
<td class="org-right">255.255.248.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/22</td>
<td class="org-right">255.255.252.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/23</td>
<td class="org-right">255.255.254.0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">/24</td>
<td class="org-right">255.255.255.0</td>
<td class="org-left">256</td>
</tr>

<tr>
<td class="org-left">/25</td>
<td class="org-right">255.255.255.128</td>
<td class="org-left">128</td>
</tr>

<tr>
<td class="org-left">/26</td>
<td class="org-right">255.255.255.192</td>
<td class="org-left">64</td>
</tr>

<tr>
<td class="org-left">/27</td>
<td class="org-right">255.255.255.224</td>
<td class="org-left">32</td>
</tr>

<tr>
<td class="org-left">/28</td>
<td class="org-right">255.255.255.240</td>
<td class="org-left">16</td>
</tr>

<tr>
<td class="org-left">/29</td>
<td class="org-right">255.255.255.248</td>
<td class="org-left">8</td>
</tr>

<tr>
<td class="org-left">/30</td>
<td class="org-right">255.255.255.252</td>
<td class="org-left">4</td>
</tr>

<tr>
<td class="org-left">/31</td>
<td class="org-right">255.255.255.254</td>
<td class="org-left">2</td>
</tr>

<tr>
<td class="org-left">/32</td>
<td class="org-right">255.255.255.255</td>
<td class="org-left">1</td>
</tr>
</tbody>
</table>


<p>
CIDR notation is a compact specification of an Internet Protocol
address and its associated routing prefix. Classless Inter-Domain
Routing (CIDR) is an Internet Protocol (IP) address allocation and
route aggregation methodology[1] used within the Internet addressing
architecture that replaced the IPv4 classful network organization of
the IP address space. It is used also for IPv6 networking, the next
generation of the IP addressing architecture.
</p>

<p>
CIDR notation is constructed from the IP address and the prefix size,
the latter being equivalent to the number of leading 1 bits in the
routing prefix mask. The IP address is expressed according to the
standards of IPv4 or IPv6. It is followed by a separator character,
the slash (/) character, and the prefix size expressed as a decimal
number.
</p>

<p>
The address may denote a single, distinct, interface address or the
beginning address of an entire network. In the latter case the CIDR
notation specifies the address block allocation of the network. The
maximum size of the network is given by the number of addresses that
are possible with the remaining, least-significant bits below the
prefix. This is often called the host identifier.
</p>

<p>
For example:
</p>

<ul class="org-ul">
<li>198.51.100.1/24 represents the given IPv4 address and its associated
routing prefix 198.51.100.0, or equivalently, its subnet
mask 255.255.255.0.</li>
<li>the IPv4 block 198.51.100.0/22 represents the 1024 IPv4 addresses
from 198.51.100.0 to 198.51.103.255.</li>
<li>the IPv6 block 2001:db8::/48 represents the IPv6 addresses
from 2001:db8:0:0:0:0:0:0 to 2001:db8:0:ffff:ffff:ffff:ffff:ffff.</li>
<li>::1/128 represents the IPv6 loopback address. Its prefix size is
128, i.e. the size of the address itself, indicating that this
facility consists of only this one address.</li>
</ul>

<p>
Before CIDR notation, IPv4 networks usually used dot-decimal notation,
an alternative representation which uses the network address followed
by the network's subnet mask. Thus, The CIDR
notation 198.51.100.0/24 would be written
as 198.51.100.0/255.255.255.0
</p>

<p>
The number of addresses of a subnet defined by the mask or prefix can
be calculated as 2address size - prefix size, in which the address
size for IPv6 is 128 and 32 for IPv4. For example, in IPv4, a prefix
size of /29 gives: 232-29 = 23 = 8 addresses.
</p>

<p>
However, because at least one of these addresses is typically used for
a gateway to other subnets, and because certain addresses are reserved
as broadcast addresses, the number of addresses available for hosts is
usually smaller.
</p>

<p>
<a href="http://wenku.baidu.com/view/736f9e1fb7360b4c2e3f649f.html">http://wenku.baidu.com/view/736f9e1fb7360b4c2e3f649f.html</a>
</p>
</div>
</div>

<div id="outline-container-org8181663" class="outline-2">
<h2 id="org8181663">IP 编址问题的演进</h2>
<div class="outline-text-2" id="text-org8181663">
<p>
划分子网在一定程度上缓解了因特网在发展中遇到的困难。然而在 1992 年因特
网仍然面临三个必须尽早解决的问题，这就是：
</p>

<blockquote>
<p>
B 类地址在 1992 年已分配了近一半，眼看就要在 1994 年 3 月全部分配完毕！
因特网主干网上的路由表中的项目数急剧增长（从几千个增长到几万个）。整个
IPv4 的地址空间最终将全部耗尽。
</p>
</blockquote>

<p>
1987 年，RFC 1009 就指明了在一个划分子网的网络中可同时使用几个不同的子
网掩码。使用变长子网掩码 VLSM (Variable Length Subnet Mask)可进一步提
高 IP 地址资源的利用率。
</p>

<p>
 在 VLSM 的基础上又进一步研究出无分类编址方法，它的正式名字是无分类域间
路由选择 CIDR (Classless Inter-Domain Routing)。
</p>
</div>

<div id="outline-container-org3bb2bf7" class="outline-3">
<h3 id="org3bb2bf7">CIDR 最主要的特点</h3>
<div class="outline-text-3" id="text-org3bb2bf7">
<p>
CIDR 消除了传统的 A 类、B 类和 C 类地址以及划分子网的概念，因而可以更
加有效地分配 IPv4 的地址空间。
</p>

<p>
CIDR 使用各种长度的“网络前缀” (network-prefix)来代替分类地址中的网络号
和子网号。
</p>

<p>
IP 地址从三级编址（使用子网掩码）又回到了两级编址。
</p>
</div>
</div>

<div id="outline-container-org869c549" class="outline-3">
<h3 id="org869c549">无分类的两级编址</h3>
<div class="outline-text-3" id="text-org869c549">
</div>
<div id="outline-container-orgdc5698f" class="outline-4">
<h4 id="orgdc5698f">无分类的两级编址的记法是：</h4>
<div class="outline-text-4" id="text-orgdc5698f">
<pre class="example">
IP 地址 ::= {&lt;网络前缀&gt;, &lt;主机号&gt;}
</pre>

<p>
CIDR 还使用“斜线记法”(slash notation)，它又称为CIDR 记法，即在 IP 地址
后面加上一个斜线“/”，然后写上网络前缀所占的比特数（这个数值对应于三级
编址中子网掩码中比特 1 的个数）。
</p>
</div>
</div>

<div id="outline-container-orgd94a636" class="outline-4">
<h4 id="orgd94a636">CIDR 将网络前缀都相同的连续的 IP 地址组成“CIDR 地址块”。</h4>
</div>

<div id="outline-container-orge8a690b" class="outline-4">
<h4 id="orge8a690b">CIDR 地址块</h4>
<div class="outline-text-4" id="text-orge8a690b">
<p>
128.14.32.0/20 表示的地址块共有 212 个地址（因为斜线后面的 20 是网络前
缀的比特数，所以主机号的比特数是 12）。
</p>

<ul class="org-ul">
<li>这个地址块的起始地址是 128.14.32.0。</li>
<li>在不需要指出地址块的起始地址时，也可将这样的地址块简称为“/20 地址块”。</li>
<li>128.14.32.0/20 地址块的最小地址：128.14.32.0</li>
<li>128.14.32.0/20 地址块的最大地址：128.14.32.255</li>
<li>全 0 和全 1 的主机号地址一般不使用。</li>
<li>128.14.32.0/20 表示的地址（212 个地址）</li>
</ul>
<pre class="example">
10000000 00001110 00100000 00000000
10000000 00001110 00100000 00000001
10000000 00001110 00100000 00000010
10000000 00001110 00100000 00000011
10000000 00001110 00100000 00000100
10000000 00001110 00100000 00000101
10000000 00001110 00101111 11111011
10000000 00001110 00101111 11111100
10000000 00001110 00101111 11111101
10000000 00001110 00101111 11111110
10000000 00001110 00101111 11111111
… …

</pre>

<p>
所有地址的20 bit前缀都是一样的
</p>
</div>
</div>

<div id="outline-container-org61a5980" class="outline-4">
<h4 id="org61a5980">路由聚合(route aggregation)</h4>
<div class="outline-text-4" id="text-org61a5980">
<p>
一个 CIDR 地址块可以表示很多地址，这种地址的聚合常称为路由聚合，它使得
路由表中的一个项目可以表示很多个（例如上千个）原来传统分类地址的路由。
路由聚合也称为构成超网(supernetting)。
</p>

<p>
CIDR 虽然不使用子网了，但仍然使用“掩码”这一名词（但不叫子网掩码）。对
于 /20 地址块，它的掩码是 20 个连续的 1。 斜线记法中的数字就是掩码中 1
的个数。
</p>

<ul class="org-ul">
<li>10.0.0.0/10 可简写为 10/10，也就是将点分十进制中低位连续的 0 省略。</li>
<li>10.0.0.0/10 隐含地指出 IP 地址 10.0.0.0 的掩码是 255.192.0.0。此掩码
可表示为CIDR 记法的其他形式</li>
<li>10.0.0.0/10 可简写为 10/10，也就是将点分十进制中低位连续的 0 省略。</li>
<li>10.0.0.0/10 相当于指出 IP 地址 10.0.0.0 的掩码是 255.192.0.0，即</li>
</ul>
<p>
11111111 11000000 00000000 00000000
</p>

<p>
网络前缀的后面加一个星号 * 的表示方法，如 00001010 00*，在星号 * 之前是网络
前缀，而星号 * 表示 IP 地址中的主机号，可以是任意值。
</p>
</div>
</div>

<div id="outline-container-org1073bf9" class="outline-4">
<h4 id="org1073bf9">构成超网</h4>
<div class="outline-text-4" id="text-org1073bf9">
<p>
前缀长度不超过 23 bit 的 CIDR 地址块都包含了多个 C 类地址。这些 C 类地
址合起来就构成了超网。CIDR 地址块中的地址数一定是 2 的整数次幂。网络前
缀越短，其地址块所包含的地址数就越多。而在三级结构的IP 地址中，划分子
网是使网络前缀变长。CIDR 作用将有类别的寻址方式替换成更灵活、浪费更少
的无类别方案。加强了路由聚合，即超网（supernetting）。
</p>
</div>
</div>
</div>
</div>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
